gemi254/ConfigAssist-ESP32-ESP8266/src/configAssist.cpp
// Sort vectors by readNo in confPairs
void ConfigAssist::sortReadOrder(){
  std::sort(_configs.begin(), _configs.end(), [] (
    const confPairs &a, const confPairs &b) {
    return a.readNo < b.readNo;}
  );
}

// Return next key and value from configs on each call in key order
bool ConfigAssist::getNextKeyVal(confPairs &c) {
  static uint8_t row = 0;
  if (row++ < _configs.size()) { 
      c = _configs[row - 1];
      return true;
  }
  // end of vector reached, reset
  row = 0;
  return false;
}

// Get the configuration in json format
String ConfigAssist::getJsonConfig(){
  confPairs c;
  String j = "{";
  while (getNextKeyVal(c)){
      j += "\"" + c.name + "\": \"" + c.value + "\",";          
  }
  if(j.length()>1) j.remove(j.length() - 1);
  j+="}";
  return j;
}

// Display config items
void ConfigAssist::dump(){
  confPairs c;
  while (getNextKeyVal(c)){
      LOG_INF("[%u]: %s = %s; %s; %i\n", c.readNo, c.name.c_str(), c.value.c_str(), c.label.c_str(), c.type );
  }
}
    
// Load json description file. On update=true update only additional pair info    
int ConfigAssist::loadJsonDict(String jStr, bool update) { 
  if(jStr==NULL) return -1; 
  DeserializationError error;
  const int capacity = JSON_ARRAY_SIZE(MAX_PARAMS)+ MAX_PARAMS*JSON_OBJECT_SIZE(8);
  DynamicJsonDocument doc(capacity);
  error = deserializeJson(doc, jStr.c_str());
  
  if (error) { 
    LOG_ERR("Deserialize Json failed: %s\n", error.c_str());
    _jsonLoaded = false;   
    return -1;    
  }
  //Parse json description
  JsonArray array = doc.as<JsonArray>();
  int i=0;
  for (JsonObject  obj  : array) {                
    confPairs c = {"", "", "", "", 0, 1};        
    if (obj.containsKey("name")){
      String k = obj["name"];
      String l = obj["label"];
      c.name = k;
      c.label = l;
      c.attribs ="";
      c.readNo = i;
      if (obj.containsKey("options")){       //Options list
        String d = obj["default"];
        String o = obj["options"];
        c.value = d;
        c.attribs = o;
        c.type = OPTION_BOX;
      }else if (obj.containsKey("datalist")){ //Combo box
        String d = obj["default"];
        String l = obj["datalist"];
        c.value = d;
        c.attribs = l;
        c.type = COMBO_BOX;            
        }else if (obj.containsKey("range")){  //Input range
        String d = obj["default"];
        String r = obj["range"];
        c.value = d;
        c.attribs = r;
        c.type = RANGE_BOX;
      }else if (obj.containsKey("file")){   //Text area
        String f = obj["file"];
        c.value = f;            
        if(obj.containsKey("default")){
          String d = obj["default"];
          c.attribs = d;
        }
        c.type = TEXT_AREA;
      }else if (obj.containsKey("checked")){ //Check box
        String ck = obj["checked"];
        c.value = ck;
        c.type = CHECK_BOX;
      }else if (obj.containsKey("default")){ //Edit box
        String d = obj["default"];
        c.value = d;
        if(obj.containsKey("attribs")){
          String a = obj["attribs"];
          c.attribs = a;
        } 
        c.type = TEXT_BOX;
      }else{
        LOG_ERR("Undefined value on param : %i.", i);
      }  

      if (c.type) { //Valid
        if(update){
          int keyPos = getKeyPos(c.name);
          //Add a Json key if not exists in ini file
          if (keyPos < 0) {
            LOG_WRN("Key: %s not found in ini file.\n", c.name.c_str());
            put(c.name, c.value,true);
            keyPos = getKeyPos(c.name);
          }
          if (keyPos >= 0) {
            //Update all other fields but not value,key        
            _configs[keyPos].readNo = i;
            _configs[keyPos].label = c.label;
            _configs[keyPos].type = c.type;
            _configs[keyPos].attribs = c.attribs;
            LOG_DBG("Json upd key[%i]=%s, type:%i, read: %i\n", keyPos, c.name.c_str(), c.type, i);
          }else{
            LOG_ERR("Undefined json Key: %s\n", c.name.c_str());
          }
        }else{
          LOG_DBG("Json add: %s, val %s, read: %i\n", c.name.c_str(), c.value.c_str(), i);                         
          add(c);
        }
        i++;
      }

    }else if (obj.containsKey("seperator")){
      String sepNo = "sep_" + String(i);
      String val =  obj["seperator"];
      addSeperator(sepNo, val);          
    }else{
      LOG_ERR("Undefined keys name/default on param : %i.", i);
    }
  }
  //sort vector for binarry search
  sort();
  sortSeperators();
  _jsonLoaded = true;
  LOG_INF("Loaded json dict\n");
  return i;
}
     
// Load config pairs from an ini file
bool ConfigAssist::loadConfigFile(String filename) {
  LOG_DBG("Loading config: %s\n",filename.c_str());
  if(filename=="") filename = _confFile;
  File file = STORAGE.open(filename,"r");
  if (!file){
    LOG_ERR("File: %s not exists!\n", filename.c_str());
    _iniValid = false;       
    return false;  
  }else if(!file.size()) {
    LOG_ERR("Failed to load: %s, size: %u\n", filename.c_str(), file.size());
    //if (!file.size()) STORAGE.remove(CONFIG_FILE_PATH); 
    _iniValid = false;       
    return false;
  }else{
    _configs.reserve(MAX_PARAMS);
    // extract each config line from file
    while (file.available()) {
      String configLineStr = file.readStringUntil('\n');
      LOG_DBG("Load: %s\n" , configLineStr.c_str());          
      loadVectItem(configLineStr);
    } 
    sort();
  }
  
  file.close();
  LOG_INF("Loaded config: %s, keyCnt: %i\n",filename.c_str(), _configs.size());
  _iniValid = true;
  return true;
}

// Delete configuration file
bool ConfigAssist::deleteConfig(String filename){
  if(filename=="") filename = _confFile;
  LOG_INF("Removing config: %s\n",filename.c_str());
  return STORAGE.remove(filename);
}

// Save configs vectors in an ini file
bool ConfigAssist::saveConfigFile(String filename) {
  if(filename=="") filename = _confFile;
  if(!_dirty){
    LOG_INF("Alread saved: %s\n", filename.c_str() );
    return true;
  } 
  File file = STORAGE.open(filename, "w+");
  if (!file){
    LOG_ERR("Failed to save config file\n");
    return false;
  }
  //Save config file with updated content
  size_t szOut=0;
  for (auto& row: _configs) {
    if(row.name==HOSTNAME_KEY){
      row.value.replace("{mac}", getMacID());
    }
    char configLine[512];
    sprintf(configLine, "%s%c%s\n", row.name.c_str(), INI_FILE_DELIM, row.value.c_str());   
    szOut+=file.write((uint8_t*)configLine, strlen(configLine));
    LOG_DBG("Saved: %s = %s, type: %i\n", row.name.c_str(), row.value.c_str(), row.type);
  }
  LOG_INF("File saved: %s, sz: %u B\n", filename.c_str(), szOut);
  file.close();
  _dirty = false;
  return true;
}
// Get system local time
String ConfigAssist::getLocalTime() {      
  struct timeval tv;
  gettimeofday(&tv, NULL);
  time_t currEpoch = tv.tv_sec;
  char timeFormat[20];
  strftime(timeFormat, sizeof(timeFormat), "%d/%m/%Y %H:%M:%S", localtime(&currEpoch));
  return String(timeFormat);
}
    
// Compare browser with system time and correct if needed
void ConfigAssist::checkTime(uint32_t timeUtc, int timeOffs){
  struct timeval tvLocal;
  gettimeofday(&tvLocal, NULL);
  
  long diff = (long)timeUtc - tvLocal.tv_sec;
  LOG_DBG("Remote utc: %lu, local: %lu\n", timeUtc, tvLocal.tv_sec);
  LOG_DBG("Time diff: %u\n",diff);      
  if( abs(diff) > 5L ){ //5 Secs
    LOG_DBG("LocalTime: %s\n", getLocalTime().c_str());          
    struct timeval tvRemote;
    tvRemote.tv_usec = 0;
    tvRemote.tv_sec = timeUtc;
    settimeofday(&tvRemote, NULL);
    String tmz;
    if(getKeyPos(TIMEZONE_KEY) >= 0) tmz = get(TIMEZONE_KEY);
    if(tmz==""){
      String tmz = "GMT";
      if(timeOffs >= 0) tmz += "+" + String(timeOffs);
      else tmz += String(timeOffs);
    } 
    setenv("TZ", tmz.c_str(), 1);
    tzset();
    LOG_INF("LocalTime after sync: %s, tmz=%s\n", getLocalTime().c_str(), tmz.c_str());
    
